01  WS-AREA. 
    05  WS-VAR PIC 9(5) VALUE 0. 
    05  WS-FLAG PIC X VALUE 'N'.

PROCEDURE DIVISION.
    IF WS-FLAG = 'Y' THEN
       ADD 10 TO WS-VAR
    ELSE
       SUBTRACT 10 FROM WS-VAR
    END-IF.
    DISPLAY WS-VAR.
    STOP RUN.