01  WS-AREA. 
    05  WS-VAR PIC 9(5) VALUE 0. 
    05  WS-FLAG PIC X VALUE 'N'.
    05  WS-FLAG-NUMERIC PIC 9 VALUE 0.

PROCEDURE DIVISION.
    IF WS-FLAG = 'Y' THEN
       MOVE 1 TO WS-FLAG-NUMERIC
    END-IF.

    IF WS-FLAG-NUMERIC = 1 THEN
       ADD 10 TO WS-VAR
    ELSE
       SUBTRACT 10 FROM WS-VAR
    END-IF.
    DISPLAY WS-VAR.
    STOP RUN.